#pragma once

#include <filesystem>


// Для вывода текущего времени
std::string Time(const std::time_t now = std::time(nullptr));

/*********************************************************************************************************************************************/

// Для корректировки имени
std::string ExtractionNameJson (const std::string& path);
std::string ExtractionNameDB (const std::string& path);

/*********************************************************************************************************************************************/

// Для создания общего пути
std::filesystem::path CreateRootDir(const std::string& sub_path);

/*********************************************************************************************************************************************/
